import React from 'react';
import '../../assets/css/PrivacyPolicy.css';

function PrivacyPolicy() {
  return (
    <div className="privacy-policy-container">
      <h2>개인정보처리방침</h2>
      <div className="policy-content">
        <h3>제1조 (개인정보의 처리 목적)</h3>
        <p>
          우리샵(이하 '회사')은 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
        </p>
        <ol>
          <li><strong>홈페이지 회원 가입 및 관리</strong><br />
            회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리 시 법정대리인의 동의여부 확인, 각종 고지·통지, 고충처리 등을 목적으로 개인정보를 처리합니다.</li>
          <li><strong>재화 또는 서비스 제공</strong><br />
            물품배송, 서비스 제공, 계약서·청구서 발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 요금결제·정산 등을 목적으로 개인정보를 처리합니다.</li>
          <li><strong>마케팅 및 광고에의 활용</strong><br />
            신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.</li>
        </ol>

        <h3>제2조 (개인정보의 처리 및 보유 기간)</h3>
        <p>
          ① 회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
        </p>
        <p>
          ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
        </p>
        <ol>
          <li><strong>홈페이지 회원 가입 및 관리</strong>: 홈페이지 탈퇴 시까지. 다만, 관계 법령 위반에 따른 수사·조사 등이 진행 중인 경우에는 해당 수사·조사 종료 시까지, 홈페이지 이용에 따른 채권·채무관계 잔존 시에는 해당 채권·채무관계 정산 시까지 보유합니다.
          </li>
          <li><strong>재화 또는 서비스 제공</strong>: 재화·서비스 공급완료 및 요금결제·정산 완료 시까지. 다만, 「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시·광고, 계약내용 및 이행 등 거래에 관한 기록은 법률에 따라 일정 기간 보존됩니다.
          </li>
        </ol>

        <h3>제3조 (개인정보의 제3자 제공)</h3>
        <p>
          회사는 정보주체의 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.
        </p>

        <h3>제4조 (개인정보처리의 위탁)</h3>
        <p>
          회사는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다. 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.
        </p>
      </div>
    </div>
  );
}

export default PrivacyPolicy;