import React from 'react';
import '../../assets/css/TermsOfService.css';

function TermsOfService() {
  return (
    <div className="terms-of-service-container">
      <h2>이용약관</h2>
      <div className="policy-content">
        <h3>제1조 (목적)</h3>
        <p>
          이 약관은 우리샵 회사(전자상거래 사업자)가 운영하는 우리샵 사이버 몰(이하 “몰”이라 한다)에서 제공하는 인터넷 관련 서비스(이하 “서비스”라 한다)를 이용함에 있어 사이버 몰과 이용자의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
        </p>

        <h3>제2조 (정의)</h3>
        <p>
          ① “몰”이란 우리샵 회사가 재화 또는 용역(이하 “재화 등”이라 함)을 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 재화 등을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 사이버몰을 운영하는 사업자의 의미로도 사용합니다.
        </p>
        <p>
          ② “이용자”란 “몰”에 접속하여 이 약관에 따라 “몰”이 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
        </p>
        <p>
          ③ ‘회원’이라 함은 “몰”에 회원등록을 한 자로서, 계속적으로 “몰”이 제공하는 서비스를 이용할 수 있는 자를 말합니다.
        </p>
        <p>
          ④ ‘비회원’이라 함은 회원에 가입하지 않고 “몰”이 제공하는 서비스를 이용하는 자를 말합니다.
        </p>

        <h3>제3조 (약관 등의 명시와 설명 및 개정)</h3>
        <p>
          ① “몰”은 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호, 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 우리샵 사이버몰의 초기 서비스화면(전면)에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
        </p>
        <p>
          ② “몰”은 이용자가 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회, 배송책임, 환불조건 등과 같은 중요한 내용을 이용자가 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공하여 이용자의 확인을 구하여야 합니다.
        </p>

        <h3>제4조 (서비스의 제공 및 변경)</h3>
        <p>
          ① “몰”은 다음과 같은 업무를 수행합니다.
        </p>
        <ol>
          <li>재화 또는 용역에 대한 정보 제공 및 구매계약의 체결</li>
          <li>구매계약이 체결된 재화 또는 용역의 배송</li>
          <li>기타 “몰”이 정하는 업무</li>
        </ol>
      </div>
    </div>
  );
}

export default TermsOfService;